while True:
    try:
        file_name = input('Введіть ім\'я файлу: ')
        file = open(file_name, 'r') #відкриваємо файл для обробки
        break
    except:
        print('Фаєл не знайдено, спробуйти ще раз') #на випадок не кореного імені файлу

text = '' #строка для тексту файлу
for i in file: #проходимось по файлу
    text += i #кожну строчку добавляємо в змінну text

file.close()

file = open(file_name, 'w') #знову відкриваємо, але з модифікатором 'w', для автоматичного очищення

wort1 = input('Введіть текст ЯКИЙ потрібно замінити: ')
wort2 = input('Введіть текст НА ЯКИЙ потрібно замінити: ')

text = text.replace(wort1, wort2) #замінюємо кожне входження wort1 на wort2

file.write(text) #записуєммо результат

file.close() #закриваємо файли і зберігаємо

print('Готово')



